In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1': np.random.randn(5),
                    'dataset2': np.random.randn(5)})

In [3]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -1.688784 -2.157998
1  X   beta -0.939451 -0.282810
2  Y  alpha -0.305641  0.026200
3  Y   beta -0.081809 -0.624658
4  Z  alpha  0.539712 -1.383374

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [6]:
group1.mean()

k1
X   -1.314117
Y   -0.193725
Z    0.539712
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.939451
    JAN   -0.305641
NY  FEB   -0.081809
    JAN   -0.574536
Name: dataset1, dtype: float64

In [9]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -1.688784 -2.157998
1  X   beta -0.939451 -0.282810
2  Y  alpha -0.305641  0.026200
3  Y   beta -0.081809 -0.624658
4  Z  alpha  0.539712 -1.383374

In [10]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -1.314117 -1.220404
Y  -0.193725 -0.299229
Z   0.539712 -1.383374

In [11]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -1.688784 -2.157998
   beta  -0.939451 -0.282810
Y  alpha -0.305641  0.026200
   beta  -0.081809 -0.624658
Z  alpha  0.539712 -1.383374

In [12]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [13]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -1.688784 -2.157998
1  X   beta -0.939451 -0.282810
2  Y  alpha -0.305641  0.026200
3  Y   beta -0.081809 -0.624658
4  Z  alpha  0.539712 -1.383374

In [15]:
for name, group in dframe.groupby('k1'):
    print("This is the %s group" %name)
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -1.688784 -2.157998
1  X   beta -0.939451 -0.282810


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.305641  0.026200
3  Y   beta -0.081809 -0.624658


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.539712 -1.383374

In [16]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print("key1 = %s Key2 %s" %(k1,k2))
    print(group)
    print('\n')

key1 = X Key2 alpha
  k1     k2  dataset1  dataset2
0  X  alpha -1.688784 -2.157998


key1 = X Key2 beta
  k1    k2  dataset1  dataset2
1  X  beta -0.939451  -0.28281


key1 = Y Key2 alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.305641    0.0262


key1 = Y Key2 beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.081809 -0.624658


key1 = Z Key2 alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  0.539712 -1.383374

In [17]:
group_dict = dict(list(dframe.groupby('k1')))
group_dict

{'X':   k1     k2  dataset1  dataset2
 0  X  alpha -1.688784 -2.157998
 1  X   beta -0.939451 -0.282810,
 'Y':   k1     k2  dataset1  dataset2
 2  Y  alpha -0.305641  0.026200
 3  Y   beta -0.081809 -0.624658,
 'Z':   k1     k2  dataset1  dataset2
 4  Z  alpha  0.539712 -1.383374}

In [18]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -1.688784 -2.157998
1  X   beta -0.939451 -0.282810

In [19]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))
group_dict_axis1 #Separating Numbers from words

{dtype('float64'):    dataset1  dataset2
 0 -1.688784 -2.157998
 1 -0.939451 -0.282810
 2 -0.305641  0.026200
 3 -0.081809 -0.624658
 4  0.539712 -1.383374,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [20]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -2.157998
   beta  -0.282810
Y  alpha  0.026200
   beta  -0.624658
Z  alpha -1.383374